# Color Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry..::..Color Property
AnalysisDisplayColorEntry Class See Also
---
Color associated with color entry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Color Color { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Color As Color
	Get
```

Visual C++
---
```text
public:
property Color^ Color {
	Color^ get ();
}
```

# See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace